* myocardio sqlite

Current soreness system is annoying: for each exercise, if we want to determine the impact on soreness, we have to check not only the soreness history for the muscles involved (that makes sense). We also have to check if there was no explicit "no soreness anymore" after the workout, and somebody just executed the next exercise.

/Proposal/: we force the user to explicitly confirm "no soreness" after a workout.

/Method/: The user still selects exercises as usual, and commits them, as usual.

When determining the soreness impact, we just use the soreness history, and expect a "no soreness" marker at some point, even if it's "unnecessary".

The UI will query (in the main interface) if there are unresolved workouts and display them. There will be a button with "I have no soreness anymore for any of these muscles".
* TODO Add more newtypes around everything
* TODO Add MonadIO to Database, remove liftIO in main
* Project myocardio 3
** DONE Beginnings
CLOSED: [2024-03-23 Sat 14:44]
:LOGBOOK:
CLOCK: [2024-03-23 Sat 14:44]--[2024-03-23 Sat 14:44] =>  0:00
CLOCK: [2024-03-23 Sat 14:32]--[2024-03-23 Sat 14:44] =>  0:12
CLOCK: [2024-03-16 Sat 09:08]--[2024-03-16 Sat 13:41] =>  4:33
CLOCK: [2024-03-11 Mon 11:15]--[2024-03-11 Mon 11:30] =>  0:15
:END:

- Ziele
  + Tracken von Übungen, Intensitäten und Muskelkater, sodass man progressions machen kann
  + Muskeln nicht doppelt oder zu viel belasten

- Muskelgruppe nach Name
- Übung
  + Liste von Muskelgruppen
- Übung gemacht
  + Datum
  + "Intensität" (also Gewicht, Dauer, ..., einfach ein String)
- Muskelkater
  + Datum
  + Liste von Muskelgruppen

- [X] Anfang
  + lucid-htmx braucht zu altes text
  + Offener issue [[https://github.com/monadicsystems/lucid-htmx/issues/12][hier]]
  + erstmal weglassen und manuell machen
- [X] Jetzt baut er diverse Dependencies und nimmt sie nicht aus Nix heraus.
  + Ihm fehlt zlib
  + =inputsFrom= fälschlicherweise auskommentiert denke ich
  + Japp
- [X] Soreness UI
- [X] Training UI
- [X] "Reset soreness" funzt nicht, 404
- [X] Auf lucid2 wechseln
- [X] Markdown to HTML
  + https://hackage.haskell.org/package/cmark-gfm
- [X] Exercises editierbar, separate JSON-Datei
- [X] Commit training
- [X] Besseres Trainingsformular
  + [X] Letzte Ausführung: wie viel Muskelkater?
  + [X] Besser auf Mobilgeräten
  + [X] Filtere nach Endurance etc. oben
- [X] Übungen editieren einbauen
- [X] Imageupload
  + [X] Formular erweitern
    * Funzt schonmal.
  + [X] Datenbankschema erweitern um Dateien für Exercises
  + [X] Dateien in korrektes Verzeichnis ablegen
  + [X] Dateien serven via scotty static route oder so
    * Braucht's nicht, gibt eh nur einen Pfad
  + [X] Dateien anzeigen und löschbar machen? Oder lieber ganze Exercises?
    * Editieren kann man immerhin schon. Jetzt nur noch Dateien anzeigen und Löschknopf einbauen?
- [X] Bilder auf Containerbreite skalieren
- [X] TOC
- [X] Badges in "Current Workout" sind zu breit
- [X] Scotty-Update
- [X] Übungen eintragen
- [X] Übungsinfos eher in My Workout statt in der Liste?
  + Mal "card" ausprobieren hierfür
  + [X] Übungsliste auch mit Cards
  + [X] "Show details" nochmal testen
- [X] Übersichtlichere Übungsliste: welche Übung gehört zu welchem Muskel?
- [X] Übungen ausblenden, die schon Teil des Trainingsprogramms sind
- [X] Current workout als separater tab
- [X] Badges mit List Groups für Textbrowser
** DONE Rebuild around full page refresh for now
CLOSED: [2024-03-23 Sat 17:29]
:LOGBOOK:
CLOCK: [2024-03-23 Sat 14:45]--[2024-03-23 Sat 17:29] =>  2:44
:END:

- [X] new/edit exercise
  + [X] cancel missing
  + [X] test
- [X] add to workout, remove from workout
- [X] remove from workout from workout view
- [X] soreness
** DONE Improve UX of soreness
CLOSED: [2024-03-24 Sun 08:57]
** DONE Show missing exercises in TOC
CLOSED: [2024-03-24 Sun 09:34]
:LOGBOOK:
CLOCK: [2024-03-24 Sun 08:57]--[2024-03-24 Sun 09:34] =>  0:37
:END:
** DONE Deploy to remote server
CLOSED: [2024-03-24 Sun 11:57]
** DONE Show history of exercises in a picture
CLOSED: [2024-03-30 Sat 08:15]
:LOGBOOK:
CLOCK: [2024-03-29 Fri 07:50]--[2024-03-29 Fri 12:13] =>  4:23
CLOCK: [2024-03-24 Sun 09:34]--[2024-03-24 Sun 11:58] =>  2:24
:END:

- History in body image?
  + [X] Base image to Nix deployment process
    * We need a static image route
  + [X] Model back image also
  + [X] Function from svg + (muscle, int) pairs to colored svg
  + [X] Color from green to red — how?
    * HSV from green to red has just yellow as intermediate colors — try that
      - [ ] hsv to rgb conversion function?
	+ Or can CSS do it natively?
  + [X] Use with last exercise
  + [X] Doublecheck the results — does it make sense?
    * Core should have ID "core-1"
    * Shoulders were wrong as well
  + [X] Muscles that aren't trained for a long time should have a lower score as well
    * lerp from 0 to 1 still (depending on time), but decrease score (red is 0 on the hsv scale) for each day
    * take the current day as max time?
    * previously, if last training was 3 days ago, and the one before that 6, then we'd interpolate between 0 and 3 days
    * afterwards we're interpolating between 6 days
** DONE Rebase on NixOS-24.05
CLOSED: [2024-06-22 Sat 07:57]
:LOGBOOK:
CLOCK: [2024-06-22 Sat 07:46]--[2024-06-22 Sat 07:57] =>  0:11
CLOCK: [2024-06-22 Sat 07:25]--[2024-06-22 Sat 07:40] =>  0:15
:END:

- changed in flake.nix, then changed scotty to 0.22, rebuilt
** DONE Copy remote DB to localhost, then try starting the program
CLOSED: [2024-06-22 Sat 07:46]
:LOGBOOK:
CLOCK: [2024-06-22 Sat 07:40]--[2024-06-22 Sat 07:46] =>  0:06
:END:
** DONE Reinstate CI
CLOSED: [2024-06-22 Sat 08:08]
:LOGBOOK:
CLOCK: [2024-06-22 Sat 07:59]--[2024-06-22 Sat 08:08] =>  0:09
:END:
** DONE Remove mobility/endurance concepts
CLOSED: [2024-06-22 Sat 08:38]
:LOGBOOK:
CLOCK: [2024-06-22 Sat 08:08]--[2024-06-22 Sat 09:08] =>  1:00
:END:

- Doesn't have to be removed from the data, but from the UI first.
** DONE Show exercise images in selection
CLOSED: [2024-06-23 Sun 08:51]
:LOGBOOK:
CLOCK: [2024-06-23 Sun 08:14]--[2024-06-23 Sun 10:37] =>  2:23
:END:

- [X] Add it
- [X] Understand caching, can we cache images more aggressively?
** DONE Improve UX for exercise list (asterisks, unordered list)
CLOSED: [2024-06-23 Sun 08:51]
:LOGBOOK:
CLOCK: [2024-06-23 Sun 07:57]--[2024-06-23 Sun 08:14] =>  0:17
CLOCK: [2024-06-22 Sat 09:39]--[2024-06-22 Sat 12:53] =>  3:14
:END:

- [X] First, convert list to colored buttons and add section filter for exercises
- [X] Add backlinks from exercise to overview, and check redirect from muscle to overview
** DONE Add "change intensity after adding to current"
CLOSED: [2024-06-23 Sun 10:37]
:LOGBOOK:
CLOCK: [2024-06-23 Sun 08:51]--[2024-06-23 Sun 10:37] =>  1:46
CLOCK: [2024-06-22 Sat 08:08]--[2024-06-22 Sat 08:08] =>  0:00
:END:
** DONE Abstract DB interface
CLOSED: [2024-06-29 Sat 12:01]
:LOGBOOK:
CLOCK: [2024-06-28 Fri 17:04]--[2024-06-28 Fri 19:15] =>  2:11
CLOCK: [2024-06-26 Wed 07:29]--[2024-06-26 Wed 07:49] =>  0:20
:END:

- [X] Add tests
  + [X] Put database into lib
  + [X] Add tests in cabal
  + [X] Write tests
- [X] Removing exercises is gone now?
** DONE Ability to remove exercises entirely
CLOSED: [2024-06-29 Sat 12:01]
:LOGBOOK:
CLOCK: [2024-06-26 Wed 06:52]--[2024-06-26 Wed 09:08] =>  2:16
CLOCK: [2024-06-24 Mon 13:14]--[2024-06-24 Mon 14:01] =>  0:47
CLOCK: [2024-06-23 Sun 10:37]--[2024-06-23 Sun 17:30] =>  6:53
:END:
** TODO History per muscle

- Select muscle
- Show a list like this
  + 2024-05-10: exercise 1 intensity 1, exercise 2, intensity 2
    * ⇒ 3 days of soreness
  + 2024-05-01: exercise 1 intensity 1, exercise 2, intensity 2
    * ⇒ no soreness
  + ...
** TODO Write a README with instructions

- Who is this for? Me specifically
- Explain how it works
** TODO Add static build artifacts
** DONE Rethink some muscles — peroneals?
CLOSED: [2024-06-30 Sun 11:02]
** TODO Soreness: just list of muscles with state on the right?
** TODO Server: Better Nix deployment
:LOGBOOK:
CLOCK: [2024-03-30 Sat 08:15]--[2024-03-30 Sat 08:25] =>  0:10
:END:

- Read Gabriella's post on nixos-rebuild switch
- Try this
** TODO Show soreness history per muscle group
** TODO Put external css dependencies into Nix deployment as well
** TODO Add breakpoints in exercise choose and current exercises as well
** TODO Reinstate and distribute static build
** TODO Muscle information (what muscle is where and so on)
** TODO Emojis for categories in new exercise form
** TODO Favicon
** CANCELLED Next
CLOSED: [2024-03-23 Sat 17:40]
- [X] Rebuild everything around "full pages" instead of partial updates
- [X] Codec for URLs instead of this "CurrentPage" nonsense right now
  + Get rid of CurrentPage, we can use Strength/Mobility/... in URLs
- [X] Exercise history on current page (einfach List reicht erst mal)
- [X] L.id_ ersetzen durch Funktion die direkt Space wegnimmt
- [X] Progressive enhancement
  + aktuell brauchen wir ja gar nichts dynamisches mehr, können versuchen auf htmx zu verzichten
- [X] Muskelinformationen: wo ist welcher Muskel usw.
  + Am besten auch in DB ablegen unter dem Enum, und mit Markdown-Editor
- [X] Favicon
- [X] Soreness etwas schöner
- [X] Statistiken über Training in Soreness-Ansicht
  + Genauer spezifizieren was wir damit meinen
- [X] Mehr Breakpoints einbauen und Platz ausnutzen
